"""
# 快捷键
# ctrl+d 复制当前行代码
# shift + alt + up/down 将当前代码行上移/下移
# shift + f6 重命名文件
# ctrl + f 搜索
"""

"""
# 数据类型（字面量）
    # 数字Number
        # 整数int
            # 整数
        # 浮点数float
            # 小数
        # 复数complex
            # 以j结尾表示复数，例如4+3j
        # 布尔bool
            # True表示真，记作1
            # False表示假，记作0
    # 字符串String
        # 文本，用双引号（“”）包围
    # 列表List
    # 元组Tuple
    # 集合Set
    # 字典Dictionary
# type()查看括号内数据类型
转换数据类型
    int(x)将x转换为整数
        小数转整数丢失小数部分
    float(y)将y转换为浮点数
        整数转浮点数带1位小数.0
    str(z)将z转换为字符串
        任何数据类型都可以转换为字符串
"""

# 注释，#后接单行注释，“”“……”“”多行注释

"""
变量
    定义格式
        变量名 = 变量值
"""

"""
标识符
    举例
        变量名
        方法名
        类名
    规则
        内容限定
            只允许出现英文、数字（不可放开头）、下划线、（中文（不推荐））
        大小写敏感
        不可使用关键字
    规范
        见名知意
            明了：见名知意
            简洁：在确保明了的前提下，减少名字的长度
        下划线命名法
            多个单词组合变量名，要用下划线做分隔
        英文字母全小写
        （不用驼峰命名法）
"""

# print()在屏幕上打印内容
    # 可以输出多份内容，用逗号隔开